In [1]:
%load_ext sql

In [2]:
%sql sqlite://

# 1.
The data for this workshop is stored in the `survey.db` file. This dataset was collected during expeditions to the South Pole in the 1920's.

In [3]:
%sql sqlite:///survey.db

First, let's write a query that will return the scientists' names.

```sql
SELECT column1, column2
FROM TABLE
```

So the query below will return the scientist's *family* (last) and *personal* (first) names:

In [4]:
%%sql
SELECT * FROM person ORDER BY id DESC;

   sqlite://
 * sqlite:///survey.db
Done.

[('roe', 'Valentina', 'Roerich'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('dyer', 'William', 'Dyer'),
 ('danforth', 'Frank', 'Danforth')]

SQL syntax is not case-sensitive, so this query is identical to the previous one:

In [7]:
%%sql
SeLeCt FaMiLy, PeRsOnAl FrOm PeRsOn;

   sqlite://
 * sqlite:///survey.db
Done.

[('Dyer', 'William'),
 ('Pabodie', 'Frank'),
 ('Lake', 'Anderson'),
 ('Roerich', 'Valentina'),
 ('Danforth', 'Frank')]

Different people will have different preferences on how to capitalize SQL queries. Personally, I like to use the convention of having upper case for SQL keywords (like `SELECT` and `FROM`).

We can also select columns in a different order, select the columns on multiple lines, etc.

#### TODO 
Write a query that returns the `person`, `quant`, and `reading` columns from the `Survey` table.

In [10]:
%%sql
SELECT person, quant, reading
FROM Survey;

   sqlite://
 * sqlite:///survey.db
Done.

[('dyer', 'rad', 9.82),
 ('dyer', 'sal', 0.13),
 ('dyer', 'rad', 7.8),
 ('dyer', 'sal', 0.09),
 ('pb', 'rad', 8.41),
 ('lake', 'sal', 0.05),
 ('pb', 'temp', -21.5),
 ('pb', 'rad', 7.22),
 (None, 'sal', 0.06),
 (None, 'temp', -26.0),
 ('pb', 'rad', 4.35),
 ('pb', 'temp', -18.5),
 ('lake', 'sal', 0.1),
 ('lake', 'rad', 2.19),
 ('lake', 'sal', 0.09),
 ('lake', 'temp', -16.0),
 ('roe', 'sal', 41.6),
 ('lake', 'rad', 1.46),
 ('lake', 'sal', 0.21),
 ('roe', 'sal', 22.5),
 ('roe', 'rad', 11.25)]

# 2.
Let's say we're assigned the two analyses:
- What kind of quantity measurements were taken at each site
- Who took the measurements

The measurements are stored in the `Survey` table.

#### TODO
Retrieve the `quant` column from the `Survey` table. What do you think this measures? Are the values unique?

In [5]:
%%sql
SELECT  quant
FROM Survey;

   sqlite://
 * sqlite:///survey.db
Done.

[('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('sal',),
 ('rad',)]

If we want to see the unique set of values in a column, we can de-duplicate using the `DISTINCT` keyword:

In [6]:
%%sql
SELECT DISTINCT quant FROM Survey;

   sqlite://
 * sqlite:///survey.db
Done.

[('rad',), ('sal',), ('temp',)]

We can also deduplicate multiple columns.

#### TODO
Get all unique combinations of `taken` and `quant` from this table.

In [7]:
%%sql
SELECT DISTINCT taken, quant FROM Survey;

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'rad'),
 (619, 'sal'),
 (622, 'rad'),
 (622, 'sal'),
 (734, 'rad'),
 (734, 'sal'),
 (734, 'temp'),
 (735, 'rad'),
 (735, 'sal'),
 (735, 'temp'),
 (751, 'rad'),
 (751, 'temp'),
 (751, 'sal'),
 (752, 'rad'),
 (752, 'sal'),
 (752, 'temp'),
 (837, 'rad'),
 (837, 'sal'),
 (844, 'rad')]

Next, let's look at the scientists on the expedition.

In [8]:
%%sql
SELECT * FROM Person;

   sqlite://
 * sqlite:///survey.db
Done.

[('dyer', 'William', 'Dyer'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('roe', 'Valentina', 'Roerich'),
 ('danforth', 'Frank', 'Danforth')]

Let's say we want these records to be returned in some order, say by ID. We can do this using the `ORDER BY` keyword:

In [10]:
%%sql
SELECT * FROM Person ORDER BY id;

   sqlite://
 * sqlite:///survey.db
Done.

[('danforth', 'Frank', 'Danforth'),
 ('dyer', 'William', 'Dyer'),
 ('lake', 'Anderson', 'Lake'),
 ('pb', 'Frank', 'Pabodie'),
 ('roe', 'Valentina', 'Roerich')]

We could reverse the order using the `DESC` keyword:

In [11]:
%%sql
SELECT * FROM Person ORDER BY id DESC;

   sqlite://
 * sqlite:///survey.db
Done.

[('roe', 'Valentina', 'Roerich'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('dyer', 'William', 'Dyer'),
 ('danforth', 'Frank', 'Danforth')]

#### TODO
Write a query that sorts in ascending order by first name. Then write another query that sortts in descending order by last name.

In [14]:
%%sql
SELECT * FROM Person ORDER BY personal ASC;

   sqlite://
 * sqlite:///survey.db
Done.

[('lake', 'Anderson', 'Lake'),
 ('pb', 'Frank', 'Pabodie'),
 ('danforth', 'Frank', 'Danforth'),
 ('roe', 'Valentina', 'Roerich'),
 ('dyer', 'William', 'Dyer')]

In [15]:
%%sql
SELECT * FROM Person ORDER BY family DESC;

   sqlite://
 * sqlite:///survey.db
Done.

[('roe', 'Valentina', 'Roerich'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('dyer', 'William', 'Dyer'),
 ('danforth', 'Frank', 'Danforth')]

Let's look again at the `Survey` table. This has a column called `person`. Let's sort the rows by this column. What do you notice about these values?

In [13]:
%%sql
SELECT * FROM Survey ORDER BY person;

   sqlite://
 * sqlite:///survey.db
Done.

[(735, None, 'sal', 0.06),
 (735, None, 'temp', -26.0),
 (619, 'dyer', 'rad', 9.82),
 (619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'rad', 7.8),
 (622, 'dyer', 'sal', 0.09),
 (734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (734, 'pb', 'rad', 8.41),
 (734, 'pb', 'temp', -21.5),
 (735, 'pb', 'rad', 7.22),
 (751, 'pb', 'rad', 4.35),
 (751, 'pb', 'temp', -18.5),
 (752, 'roe', 'sal', 41.6),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

We can order by multiple columns, both ascending and descending. For example, let's order the rows of `Survey` by  `taken` in ascending order and `person` in descending order:

In [16]:
%%sql
SELECT * FROM Survey ORDER BY taken ASC, person DESC;

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'dyer', 'rad', 9.82),
 (619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'rad', 7.8),
 (622, 'dyer', 'sal', 0.09),
 (734, 'pb', 'rad', 8.41),
 (734, 'pb', 'temp', -21.5),
 (734, 'lake', 'sal', 0.05),
 (735, 'pb', 'rad', 7.22),
 (735, None, 'sal', 0.06),
 (735, None, 'temp', -26.0),
 (751, 'pb', 'rad', 4.35),
 (751, 'pb', 'temp', -18.5),
 (751, 'lake', 'sal', 0.1),
 (752, 'roe', 'sal', 41.6),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (837, 'roe', 'sal', 22.5),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (844, 'roe', 'rad', 11.25)]

#### TODO
Let's look more closely at which scientists toook each type of measurement. It would be easier to do this if we deduplicated the results. So write a query that does the following:
- Returns unique rows of `taken`, `person`, and `quant`
- Sorts first by `taken`, and then by descending `person`

#### TODO
Scientists on this expedition might have specialized in certain types of measurements. What would be a good way to see this?

In [17]:
%%sql
SELECT person, quant FROM Survey
ORDER BY person, quant;

   sqlite://
 * sqlite:///survey.db
Done.

[(None, 'sal'),
 (None, 'temp'),
 ('dyer', 'rad'),
 ('dyer', 'rad'),
 ('dyer', 'sal'),
 ('dyer', 'sal'),
 ('lake', 'rad'),
 ('lake', 'rad'),
 ('lake', 'sal'),
 ('lake', 'sal'),
 ('lake', 'sal'),
 ('lake', 'sal'),
 ('lake', 'temp'),
 ('pb', 'rad'),
 ('pb', 'rad'),
 ('pb', 'rad'),
 ('pb', 'temp'),
 ('pb', 'temp'),
 ('roe', 'rad'),
 ('roe', 'sal'),
 ('roe', 'sal')]

#### TODO
Write a query that selects unique dates from `Visited`.

In [18]:
%%sql
SELECT DISTINCT dated FROM Visited;

   sqlite://
 * sqlite:///survey.db
Done.

[('1927-02-08',),
 ('1927-02-10',),
 ('1930-01-07',),
 ('1930-01-12',),
 ('1930-02-26',),
 (None,),
 ('1932-01-14',),
 ('1932-03-22',)]

# 3. Filtering
So far, we've been either selecting all the rows of a table (sometimes de-duplicating them). But often we need to select data that match a certain criteria. For example:
- Patients who have a certain diagnosis
- Patients who received treatment during a certain timeframe
- Patients with certain characterisitcs

To do that, we need to **filter** the data. For example, let's look at the sites in the `Visited` table:

In [19]:
%%sql
SELECT DISTINCT Site FROM Visited;

   sqlite://
 * sqlite:///survey.db
Done.

[('DR-1',), ('DR-3',), ('MSK-4',)]

Let's look at just rows that came from site **DR-1**. We do this using the `WHERE` keyword:

In [20]:
%%sql
SELECT *
FROM Visited 
WHERE site = 'DR-1'
ORDER BY dated;

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (844, 'DR-1', '1932-03-22')]

SQL does this by executing a two-step query.
- First, it identifies rows in the table where site = 'DR-1'
- Then, it selects the columns we're interested in
![](https://swcarpentry.github.io/sql-novice-survey/fig/sql-filter.svg)

Because of this order, we can filter based on columns that we don't actually select.

SQL filters based on **Boolean** logic, meaning that it checks whether a certain condition is `true` or `false` in each row, and then returns the rows where the condition is `true`.

The last example had a boolean condition that would be true if two text values were equal. But we could do other operators. For example, let's say we wanted all rows that were recorded before 1930:

In [21]:
%%sql
SELECT *
FROM Visited 
WHERE dated < '1930-01-01'
ORDER BY id;

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'DR-1', '1927-02-08'), (622, 'DR-1', '1927-02-10')]

We can combine by using `AND`:

In [24]:
%%sql
SELECT *
FROM Visited 
WHERE dated < '1930-01-12' AND site = 'DR-1'
ORDER BY id;

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'DR-1', '1927-02-08'), (622, 'DR-1', '1927-02-10')]

#### TODO
Write a query that takes all survey measurements that were taken by **lake**.

In [23]:
%%sql
SELECT * FROM Survey WHERE person = 'lake';

   sqlite://
 * sqlite:///survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21)]

#### TODO
Write a query that takes all survey measurements for temperature that had a value between -25 and -20.

In [26]:
%%sql
SELECT * FROM Survey 
WHERE reading > -25
    AND reading < -20;

   sqlite://
 * sqlite:///survey.db
Done.

[(734, 'pb', 'temp', -21.5)]

Earlier, we used the `AND` keyword, which required that both conditions be true. We could also require that either condition be true using the `OR` keyword:

In [27]:
%%sql
SELECT * FROM Survey WHERE person = 'lake' OR person = 'roe';

   sqlite://
 * sqlite:///survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

Or we can use `IN` to see if a value is in a specific set:

In [28]:
%%sql
SELECT * FROM Survey WHERE person IN ('lake', 'roe');

   sqlite://
 * sqlite:///survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

We can also combine `AND` with `OR`, but need to be careful. For example, let's say we want to find all `sal` quantities taken by either `roe` or `lake`. We might write this query:

```sql
SELECT * FROM Survey WHERE quant = 'sal' AND person = 'lake' OR person = 'roe';
```

#### TODO
What's wrong with that query?

In this query does this mean:
- Option 1:
    - Records with a quant of `sal` AND person = 'lake'
    - or a person = 'roe'
- Option 2:
    - Records with a quant of 'sal'
    - And records where the person = 'lake' or the person = 'roe'


We can use parentheses instead:

In [29]:
%%sql
SELECT * FROM Survey WHERE quant = 'sal' AND (person = 'lake' OR person = 'roe');

   sqlite://
 * sqlite:///survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'sal', 0.09),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5)]

#### TODO
Write two different queries that return records from `Visited` where `site` starts with **DR**.

In [30]:
%%sql
SELECT *
FROM Visited 
WHERE site = 'DR-1' OR site = 'DR-3';

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (844, 'DR-1', '1932-03-22')]

In [31]:
%%sql
SELECT *
FROM Visited 
WHERE site IN ('DR-1', site = 'DR-3')

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (844, 'DR-1', '1932-03-22')]

## Wildcards
We might want to match different combinations of strings. The `LIKE` operator lets us search for wildcards using `%`:

In [32]:
%%sql
SELECT * FROM Visited WHERE site LIKE 'DR%';

   sqlite://
 * sqlite:///survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (844, 'DR-1', '1932-03-22')]

## Growing queries

**"Find out what quantities were measured by Drs. Lake and Roe"

1. Select the person and quantity from the survey table
2. Limit to records with Lake or Roe
3. Deduplicate

In [ ]:
%%sql
SELECT * FROM Visited WHERE site LIKE 'DR%';

#### TODO
Suppose we want to select all sites that lie within 48 degrees of the equator. Our first query is:

In [33]:
%%sql
SELECT * FROM Site WHERE (lat > -48) OR (lat < 48);

   sqlite://
 * sqlite:///survey.db
Done.

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [35]:
%%sql
SELECT * FROM Site WHERE (lat > -48) AND (lat < 48);

   sqlite://
 * sqlite:///survey.db
Done.

[('DR-3', -47.15, -126.72)]

#### TODO
Normalized salinity readings are supposed to be between 0.0 and 1.0. Write a query that selects all records from Survey with salinity values outside this range.

In [36]:
%%sql
SELECT * FROM Survey WHERE quant = 'sal' AND ((reading > 1.0) OR (reading < 0.0));

   sqlite://
 * sqlite:///survey.db
Done.

[(752, 'roe', 'sal', 41.6), (837, 'roe', 'sal', 22.5)]

#### TODO
Which of these expressions are `true`?

1. `'a' LIKE 'a'`
2. `'a' LIKE '%a'`
3. `'beta' LIKE '%a'`
4. `'alpha' LIKE 'a%%'`
5. `'alpha' LIKE 'a%p%'`